functionalTests/cfdemIBMesh/couette/constant/immersedBoundaryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      immersedBoundaryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

objectType "mesh";
alpha 0.5;                 // relaxation parameter
logInterval 10;
enableVolumeMeshCorrection
(
off
);

omega
(
1.
);

axis
(
 (0 0 1.)
);

centerOfRotation
(
 (0 0. 0)
);

linearVelocity
(
(0. 0. 0.)
);

volumeMesh
(
0.0001963495408493621
);

surfaceName
(
    "./constant/triSurface/couette.stl"
);

invariant
(
false
);

enableVolumeMeshCorrection
(
true
);
// ************************************************************************* //
